foamCases/newMesh0/teste6/teste5/system/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1812                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     1812;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type               hePsiThermo;
    mixture            pureMixture;
    transport          const;
    thermo             hConst;
    equationOfState    perfectGas;
    specie             specie;
    energy             sensibleInternalEnergy;//sensibleEnthalpy;
}

mixture
{
    specie
    {
        nMoles         1;
        molWeight      28.9;
    }
    thermodynamics
    {
        Cp             1005;
        Hf             0;
    }
    transport
    {
        mu             0; //1.8e-05;
        Pr             0.7;
    }
}

// ************************************************************************* //
